Revit 2024 API
PointCloudInstance.SetSelectionFilter Method
 Sets active selection filter by cloning of the one passed to it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetSelectionFilter(
	PointCloudFilter pFilter
)
Visual Basic
Public Sub SetSelectionFilter ( _
	pFilter As PointCloudFilter _
)
Visual C++
public:
void SetSelectionFilter(
	PointCloudFilter^ pFilter
)
Parameters
pFilter
Type: Autodesk.Revit.DB.PointClouds.PointCloudFilter
 The filter object to be made active. If null is supplied, the active filter is removed.
Remarks
 The filter is provided in the coordinates of the Revit model. If the point cloud is altered (e.g. by moving, rotating, scaling or other modifications) the point cloud filter is not modified and the set of highlighted or isolated points will change. The selection filter is not preserved when the Revit document is saved.
See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace